app/Services/DashboardService.php

    public function getDashboardData(int $userId): array
    {
        $user = (new UserModel())->find($userId);
        if (!$user) {
            throw new \RuntimeException('Utilisateur introuvable');
        }

        // Gold actif
        $isGold = (int)($user['is_gold'] ?? 0) === 1;

        // Wallet
        $walletBalance = (float)($user['wallet_balance'] ?? 0);

        // IMC + ideal
        $imcService = new ImcService();
        $poids = (float)($user['poids'] ?? 0);
        $taille = (float)($user['taille'] ?? 0);
        $imc = $imcService->calculateIMC($poids, $taille);

        $objectiveLabel = $this->getObjectiveLabel((string)($user['objectif'] ?? $user['objective'] ?? 'ideal'));
        $latestWeight = (new WeightHistoryModel())
            ->where('user_id', $userId)
            ->orderBy('date_mesure', 'DESC')
            ->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = 5
SELECT *
FROM `weight_history`
WHERE `user_id` = 5
ORDER BY `date_mesure` DESC
 LIMIT 1

        $goldDiscount = max(0.0, min(1.0, $goldDiscountPct / 100));

        // Subscription active
        $activeSubscription = (new SubscriptionModel())
            ->where('user_id', $userId)
            ->where('date_fin >=', date('Y-m-d'))
            ->orderBy('date_fin', 'DESC')
            ->first();
---
SELECT *
FROM `subscriptions`
WHERE `user_id` = 5
AND `date_fin` >= '2026-05-11'
ORDER BY `date_fin` DESC
 LIMIT 1