app/Services/FinanceService.php

SELECT *
FROM `users`
WHERE `users`.`id` = 5
---
    public function getFinanceData(int $userId): array
    {
        $user = (new UserModel())->find($userId);