app/Controllers/Api/AuthController.php

    public function login()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->sendError($this->validator->getErrors());
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $this->request->getVar('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'nah@gmail.com'
 LIMIT 1