app/Controllers/Api/WeightController.php

    public function addWeight()
    {
        $poids = (float) ($this->request->getVar('poids') ?? 0);
        $date = $this->request->getVar('date_mesure') ?? date('Y-m-d');
        $userId = session()->get('user_id');

        if (!$userId) {
            return $this->sendError('Utilisateur non connecté', 401);
        }

        if ($poids <= 0) {
            return $this->sendError('Poids invalide');
        }

        $model = new WeightHistoryModel();

        if ($model->insert(['user_id' => $userId, 'poids' => $poids, 'date_mesure' => $date])) {
---
INSERT INTO `weight_history` (`user_id`, `poids`, `date_mesure`) VALUES (5, 76, '2026-05-14')

    public function getChartData()
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return $this->sendError('Utilisateur non connecté', 401);
        }

        $model = new WeightHistoryModel();

        $history = $model->where('user_id', $userId)->orderBy('date_mesure', 'ASC')->findAll();
---
SELECT *
FROM `weight_history`
WHERE `user_id` = 5
ORDER BY `date_mesure` ASC