app/Controllers/AuthController.php

INSERT INTO `users` (`nom`, `prenom`, `email`, `password_hash`, `genre`, `taille`, `poids`) VALUES ('TestNom', 'testprenom', 'test1@gmail.com', '$2y$10$WDTj/Ncez/xQ5RFEuoCk8.BvUAu5.zi0Gqngtve2cXV6jWWIM9wnO', 'H', '175', '88')
INSERT INTO `weight_history` (`user_id`, `poids`, `date_mesure`) VALUES (5, 88, '2026-05-11')
---
    public function registerFull() {

        $rules = [
            'nom' => 'required|min_length[2]',
            'prenom' => 'required|min_length[2]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[8]',
            'taille' => 'required|numeric|greater_than[50]',
            'poids' => 'required|numeric|greater_than[20]',
        ];

        if (!$this->validate($rules)) {
            return $this->response->setJSON(['status' => 'error', 'errors' => $this->validator->getErrors()]);
        }

        $data = [
            'nom'    => $this->request->getPost('nom'),
            'prenom' => $this->request->getPost('prenom'),
            'email'  => $this->request->getPost('email'),
            'password_hash' => $this->request->getPost('password'),
            'genre'  => $this->request->getPost('genre'),
            'taille' => $this->request->getPost('taille'),
            'poids'  => $this->request->getPost('poids'),
            'objectif' => $this->request->getPost('objectif'),
        ];

        if ($this->userModel->insert($data)) {
            $userId = (int) $this->userModel->getInsertID();
            (new WeightHistoryModel())->insert([
                'user_id' => $userId,
                'poids' => (float) $data['poids'],
                'date_mesure' => date('Y-m-d'),
            ]);