app/Models/RegimeModel.php

SELECT `regimes`.*, `prix_regime`.`prix` as `prix_base`
FROM `regimes`
LEFT JOIN `prix_regime` ON `prix_regime`.`regime_id` = `regimes`.`id`
GROUP BY `regimes`.`id`
---
    public function getRegimesWithPrice()
    {
        return $this->select('regimes.*, prix_regime.prix as prix_base')
                    ->join('prix_regime', 'prix_regime.regime_id = regimes.id', 'left')
                    ->groupBy('regimes.id')
                    ->findAll();